/*===========================================================================================
概　略：クリア画面を扱う処理
作成日：4/21
更新日：
制作者：渡邉諒太
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "UnitBase.h"
#include "Sprite.h"

//―――――――――――――――――――――
//	クリアクラス
//―――――――――――――――――――――
class Clear :public UnitBase
{
	Sprite sprite;

public:
	//コンストラクタ
	Clear();
	//デストラクタ
	~Clear();

	//読み込み処理
	HRESULT Load();
	//更新処理
	HRESULT Update();
	//描画処理
	//引数：hdc	デバイスコンテキストハンドル
	HRESULT Render();
};

