/*=======================================================================================================
概　略：クリアユニット
作成日：4/28(火)
更新日：4/28(火)
制作者：渡邉　諒太
=======================================================================================================*/


//---------------インクルード-----------------------
#include "Clear.h"


//――――――――――――――――――――――
//	コンストラクタ
//――――――――――――――――――――――
Clear::Clear()
{
}


//――――――――――――――――――――――
//	デストラクタ
//――――――――――――――――――――――
Clear::~Clear()
{
}


//――――――――――――――――――――――
// 機能：読み込み処理
// 引数：なし
// 戻値：成功/失敗
//――――――――――――――――――――――
HRESULT Clear::Load()
{
	//クリア画面の読み込み
	if (FAILED(sprite.Load("assets\\pict\\clear.bmp")))
	{
		return E_FAIL;
	}
	return S_OK;
}


//――――――――――――――――――――――
// 機能：更新処理
// 引数：なし
// 戻値：成功/失敗
//――――――――――――――――――――――
HRESULT Clear::Update()
{
	return S_OK;
}


//――――――――――――――――――――――
// 機能：描画処理
// 引数：なし
// 戻値：成功/失敗
//――――――――――――――――――――――
HRESULT Clear::Render()
{
	SpriteData data;
	sprite.Draw(&data);
	return S_OK;
}
