///*=======================================================================================================
//概　略：敵ユニット2
//作成日：10/28
//更新日：12/3
//制作者：渡邉　諒太
//=======================================================================================================*/
//
//
//#include "Enemy.h"
//
//
////コンストラクタ
//Enemy::Enemy()
//{
//	//敵の初期位置
//	position.x = 800;
//	position.y = 125;
//	//敵の移動量
//	move.x = 1.3;
//	move.y = 0;
//	//初期スクロール位置
//	g_stageScrollPos = D3DXVECTOR3(0, 0, 0);
//	//初期化
//	enemy = NULL;
//	//敵が生きている時TRUE（フラグ）
//	enemyLive = TRUE;
//}
//
//
////デストラクタ
//Enemy::~Enemy()
//{
//	//解放
//	SAFE_DELETE(enemy);
//}
//
//
////――――――――――――――――――――――
//// 機能：読み込み処理
//// 引数：なし
//// 戻値：成功/失敗
////――――――――――――――――――――――
//HRESULT Enemy::Load()
//{
//	enemy = new Sprite;
//
//	//敵の読み込み
//	if (FAILED(enemy->Load("Assets\\Pict\\enemy1.png")))
//	{
//		MessageBox(0, "敵を読み込めませんでした。", "読み込みエラー", MB_OK);
//		return E_FAIL;
//	}
//
//	return S_OK;
//}
//
//
////――――――――――――――――――――――
//// 機能：更新処理
//// 引数：なし
//// 戻値：成功/失敗
////――――――――――――――――――――――
//HRESULT Enemy::Update()
//{
//	//生きていれば
//	if (enemyLive)
//	{
//		//簡単な移動
//		position.x += move.x;
//
//		//画面左端
//		if (position.x < 760)
//			move.x *= -1;		//跳ね返る
//
//		//画面右端
//		if (position.x > 908)
//			move.x *= -1;		//跳ね返る
//	}
//
//	return S_OK;
//}
//
//
////――――――――――――――――――――――
//// 機能：更新処理
//// 引数：なし
//// 戻値：成功/失敗
////――――――――――――――――――――――
//HRESULT Enemy::Hit(UnitBase* pTarget)
//{
//	return S_OK;
//}
//
//
////――――――――――――――――――――――
//// 機能：描画処理
//// 引数：なし
//// 戻値：成功/失敗
////――――――――――――――――――――――
//HRESULT Enemy::Render()
//{
//	//プレイヤー画像のサイズ調整
//SpriteData playerData;
//playerData.pos = position + g_stageScrollPos;	//表示位置はスクロールした分ずらす
//playerData.size = D3DXVECTOR2(32, 32);			//サイズ
//playerData.cut.y = dir * 32;					//切抜き位置
//playerData.cut.x = ((anim / 9) % 4) * 32;
//}