/*===========================================================================================
概　略：タイトル画面
作成日：
更新日：9/14
制作者：渡邉諒太
=============================================================================================*/


#include "Title.h"


//――――――――――――――――――――――
//	コンストラクタ
//――――――――――――――――――――――
Title::Title()
{

}


//――――――――――――――――――――――
//	デストラクタ
//――――――――――――――――――――――
Title::~Title()
{

}


//――――――――――――――――――――――
// 機能：読み込み処理
// 引数：なし
// 戻値：成功/失敗
//――――――――――――――――――――――
HRESULT Title::Load()
{
	//タイトル画面の読み込み
	if (FAILED(sprite.Load("assets\\pict\\title.bmp")))
	{
		return E_FAIL;
	}
	

	return S_OK;
}


//――――――――――――――――――――――
// 機能：更新処理
// 引数：なし
// 戻値：成功/失敗
//――――――――――――――――――――――
HRESULT Title::Update()
{
	//スペースキーまたはAボタンが押されたら
	if (g_pInput->IsKeyTap(DIK_SPACE))
	{
		//プレイシーンへ
		g_gameScene = SC_PLAY;
	}
	return S_OK;
}


//――――――――――――――――――――――
// 機能：描画処理
// 引数：なし
// 戻値：成功/失敗
//――――――――――――――――――――――
HRESULT Title::Render()
{
	SpriteData data;
	sprite.Draw(&data);
	return S_OK;
}
