/*===========================================================================================
概　略：各ゲームユニットの親クラス
作成日：
更新日：
制作者：渡邉諒太
=============================================================================================*/


//---------------インクルード-----------------------
#include "UnitBase.h"


//――――――――――――――――――――――
// 機能：読み込み処理
// 引数：なし
// 戻値：成功/失敗
//――――――――――――――――――――――
HRESULT UnitBase::Load()
{
	return S_OK;
}


//――――――――――――――――――――――
// 機能：更新処理
// 引数：なし
// 戻値：成功/失敗
//――――――――――――――――――――――
HRESULT UnitBase::Update()
{
	return S_OK;
}


//――――――――――――――――――――――
// 機能：衝突判定処理
// 引数：なし
// 戻値：成功/失敗
//――――――――――――――――――――――
HRESULT UnitBase::Hit(UnitBase* pTarget)
{
	return S_OK;
}


//――――――――――――――――――――――
// 機能：描画処理
// 引数：なし
// 戻値：成功/失敗
//――――――――――――――――――――――
HRESULT UnitBase::Render()
{
	return S_OK;
}